import numpy as np
import matplotlib.pyplot as plt
import networkx as nx


def form_node_svyaz(start, end, length=1, time=1):
    return {'start': start, 'end': end, 'length': length, 'time': time}


animals = {
    "Пингвин": ["Казаур", "Журавли"],
    "Ирбис": ["Овцебыки", "Утки", "Северный олень", "Китоглав"],
    "Слоны": ["Жабы", "Лягушки", "Ластоногие", "Сурок"],
    "Сурок": ["Слоны", "Тюлень"],
    "Ластоногие": ["Журавли", "Аисты", "Слоны", "Фазаны", "Овцебыки", "Утки"],
    "Еноты": ["Кустарниковая собака", "Як", "Гривистый волк", "Змеи"],
    "Кустарниковая собака": ["Енот", "Як", "Гривистый волк"],
    "Як": ["Енот", "Кустарниковая собака", "Гривистый волк", "Леопард", "Рысь", "Пума"],
    "Овцебык": ["Фазан", "Утки", "Ирбис", "Северный_олень"],
    "Серый-тюлень": ["Сурок", "Змеи", "Ящерецы", "Волки"],
    "Северный-олень": ["Тапир", "Ирбис", "Овцебыки"],
    "Китоглав": ["Ирбис", "Утки"],
    "Змеи":["Северный тюлень","Сурок","Ящерицы"],
    "Белые медведи":["Полярная сова","Выдра","Кенгуру Беннета","Гигантская выдра","Росомаха"],
    "Обезьяны":["Росомаха","Орлы","Лемуры","Крокодилы","Змеи","Вараны"],
    "Жираф":["Сурикаты","Лемуры","Лошади","Карликовый бегемот"],
    "Бурый медведь":["Шакалы","Азиатские львы","Карликовый бегемот","Полосатые гиены","Полярные волки"]


}
p = "Жираф"
print(animals[p])

G = nx.Graph()
map_dict = []

for animal, animal_list in animals.items():
    for animal_neighbor in animal_list:
        animal_dict = form_node_svyaz(animal, animal_neighbor)
        map_dict.append(animal_dict)

for pts in map_dict:
    G.add_edge(pts['start'], pts['end'], weight=pts['time'])

pos = nx.spring_layout(G)
nx.draw(G, pos, node_color='lawngreen', with_labels=True)
plt.show()